In [1]:
import pandas as pd
from cassandra.cluster import Cluster
from cql_queries import *

In [3]:
cluster = Cluster(['127.0.0.1'], port=9042)
session = cluster.connect()

try:
    session.set_keyspace('sparkify')
except Exception as e:
    print(e)

In [11]:
rows = session.execute(select_song_library)
df = pd.DataFrame(rows)
df

      artist                       song_title  song_length
0  Faithless  Music Matters (Mark Knight Dub)   495.307312

In [12]:
rows = session.execute(select_user_library)
df = pd.DataFrame(rows)
df

,artist,song_title,first_name,last_name
0,Down To The Bone,Keep On Keepin' On,Sylvie,Cruz
1,Three Drives,Greece 2000,Sylvie,Cruz
2,Sebastien Tellier,Kilometer,Sylvie,Cruz
3,Lonnie Gordon,Catch You Baby (Steve Pitron & Max Sanna Radio...,Sylvie,Cruz

In [13]:
rows = session.execute(select_music_app_history)
df = pd.DataFrame(rows)
df

  first_name   last_name
0      Lynch  Jacqueline
1     Levine       Tegan
2    Johnson        Sara

In [ ]:
for query in drop_table_queries:
    session.execute(query)